<template>
    <el-row :gutter="0">
        <el-col :span="16" :offset="4">
            <span class="title weight">检查项目</span>
            <div class="split clearfix"></div>
            <span class="subtitle weight">JIAN CHA XIANG MU</span>
            <div class="bottom clearfix"></div>
            <div class="content-project">
                <div class="content-left font-16">
                     <div v-for="(item,index) in tabList "  
                     :class="{checkStyle:change == index}" @click="contentPet1(index)">
                     {{item.title}}</div>
                </div>
                <div>
                    <div class="t-l pane-cont" v-show='flag' v-html='templateStyle'>
                    </div>
                </div>
            </div>
        </el-col>
    </el-row>
</template>
<script>
    import ins1 from '@/assets/ins1.png'
    import ins2 from '@/assets/ins2.jpg'
    export default {
        data() {
            return {
                activeName: 'first',
                ins1:ins1,
                ins2:ins2,
                flag:true,
                change:0,
                tabList:[
                    {"show":true,"title":"PET/CT 检查"},
                    {"show":false,"title":"3.0TMR 检查"}
                ],
                templateStyle:`<p class="color-29a1d5 weight font-22 checkContent">SIEMENS Biograph mCT</p>
                        <p class="color-29a1d5 weight font-22 checkContent">正电子发射及计算机断层扫描系统<span class="pet-cont">PET/CT检查</span></p>
                        <img src="">
                        <p class="checkContent color-29a1d5 weight font-18">目前全球应用于肿瘤诊断、分期、疗效评估及预后的主要医学影像设备</p>
                        <p class="checkContent color-29a1d5 weight font-22 fit-cont">适用于</p>
                        <p class="font-18 checkContent"><span class="weight add-cont" v-for="">+</span>其他检查设备不能确诊的肿瘤病灶</p>
                        <p class="font-18 checkContent"><span class="weight add-cont">+</span>不明原因的转移性肿瘤寻找原发病灶</p>
                        <p class="font-18 checkContent"><span class="weight add-cont">+</span>恶性肿瘤的放射性治疗提供精确定位</p>
                        <p class="font-18 checkContent"><span class="weight add-cont">+</span>判断肿瘤是否发生转移以及转移病灶的部位</p>
                        <p class="font-18 checkContent"><span  class="weight add-cont">+</span>评估肿瘤的治疗疗效并指导制定恰当的解决方案</p>
                        <p class="font-18 checkContent"><span  class="weight add-cont">+</span>判断恶性肿瘤治疗是否复发</p>`     
             }  
        },
        methods: {
            handleClick(tab, event) {
                console.log(tab, event);
            },
            contentPet1 (index) {
                this.change = index
                if (index === 0){
                    this.templateStyle = `<div><h1>将习近平新时代中国特色社会主义思想载入宪法的重大意义</h1><div bosszone="titleDown"><span bosszone="textFvrtop"></span></div></div><div accesskey="3" tabindex="-1"><div id="Cnt-Main-Article-QQ" bosszone="content"><p>新华社北京2月26日电<strong>题：将习近平新时代中国特色社会主义思想载入宪法的重大意义</strong></p><p>党的十九届二中全会审议通过的《中共中央关于修改宪法部分内容的建议》，在充分发扬民主、广泛凝聚共识的基础上，提出将习近平新时代中国特色社会主义思想载入宪法。这充分反映了全党全国各族人民的共同意愿，体现了党的主张和人民意志的高度统一，对于巩固全党全国各族人民为实现中华民族伟大复兴而奋斗的共同思想基础，夺取新时代中国特色社会主义伟大胜利，具有重大的现实意义和深远的历史意义。</p><p><strong>一、将习近平新时代中国特色社会主义思想载入宪法，把党的指导思想转化为国家指导思想，是党和国家事业发展的迫切需要，也是我国宪法完善发展的内在要求</strong></p><p>宪法是国家根本法，是治国安邦的总章程，是党和人民意志的集中体现。我国现行宪法颁布以来，在改革开放和社会主义现代化建设的历史进程中、在我们党治国理政的实践中发挥了十分重要的作用。我国宪法确立一系列制度、原则和规则，确定的一系列大政方针，反映了我国各族人民共同意志和根本利益，是我们国家和人民经受住各种困难和风险考验、始终沿着中国特色社会主义道路前进的根本法治保障。改革开放以来我国各方面事业发展取得的巨大成就，都离不开宪法的保证和推动；我国社会主义民主法治建设取得的巨大成就，也无不闪耀着宪法精神的光辉。</p><p>从1954年我国第一部宪法诞生至今，一直处在探索实践和不断完善过程中。1982年宪法公布施行后，根据我国改革开放和社会主义现代化的实践和发展，在党中央领导下，全国人大于1988年、1993年、1999年、2004年，先后4次对1982年宪法即我国现行宪法的个别条款和部分内容作出必要的、也是十分重要的修正，共通过了31条宪法修正案，主要目的就是把党和人民创造的伟大成就和宝贵经验上升为国家宪法规定。其中，1999年3月15日九届全国人大二次会议通过的宪法修正案第十二条将邓小平理论写进宪法，2004年3月14日十届全国人大二次会议通过的宪法修正案第十八条将“三个代表”重要思想写进宪法，对我国改革开放和社会主义现代化建设发挥了重大指导作用。实践证明，通过修改宪法及时把党的指导思想确立为国家的指导思想，实现党的主张、国家意志、人民意愿的高度统一，对于党和国家事业发展至关重要。这是改革开放以来我们党治国理政的一条成功经验，也是我国宪法与时俱进、完善发展的内在要求。</p><p>党的十八大以来，以习近平同志为核心的党中央团结带领全党全国各族人民勇于进行具有许多新的历史特点的伟大斗争，围绕回答好新时代坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义这个重大时代课题，提出了一系列治国理政新理念新思想新战略，创立了习近平新时代中国特色社会主义思想，推动党和国家事业取得历史性成就、发生历史性变革，中国特色社会主义进入了新时代。习近平新时代中国特色社会主义思想，是马克思主义中国化最新成果，是党和人民实践经验和集体智慧的结晶，是全党全国人民为实现中华民族伟大复兴而奋斗的行动指南，是党的十八大以来党和国家事业取得历史性成就、发生历史性变革的根本理论指引，其政治意义、理论意义、实践意义已被实践充分证明，得到全党全国人民的高度认同。</p><p>党的十九大通过的党章修正案，以党内根本法的形式确立了习近平新时代中国特色社会主义思想为全党的指导思想，实现了党的指导思想与时俱进。通过修改宪法，以国家根本法的形式确立习近平新时代中国特色社会主义思想在国家政治和社会生活中的指导地位，实现国家指导思想与时俱进，对于进一步巩固全党全国各族人民团结奋斗的共同思想基础，充分发挥习近平新时代中国特色社会主义思想对国家各项事业、各方面工作的指导作用，确保党和国家事业始终沿着正确方向前进，意义重大而深远。同时，也有利于推动我国宪法完善发展，更好维护宪法的统一、尊严、权威，更好发挥宪法对我国政治和社会生活的规范、引领、推动、保障作用。</p><p><strong>二、将习近平新时代中国特色社会主义思想载入宪法，进一步明确新时代国家发展的根本任务、奋斗目标、战略步骤，有利于更好地团结激励全党全国各族人民为实现中华民族伟大复兴的中国梦而奋斗</strong></p><p>我国宪法同一些外国宪法相比较，一大特色就是明确规定了国家的根本任务、发展道路、奋斗目标，经济建设、政治建设、文化建设、社会建设、生态文明建设和国家各方面事业在宪法中都有体现、都有要求。这是我国宪法能够推动国家发展进步、保证人民创造幸福生活、保障中华民族实现伟大复兴的重要因素。</p><p>习近平新时代中国特色社会主义思想，从理论和实践结合上系统回答了新时代坚持和发展中国特色社会主义的总目标、总任务、总体布局、战略布局和发展方向、发展方式、发展动力、战略步骤、外部条件、政治保证等基本问题，并且根据新的实践对经济、政治、法治、科技、文化、教育、民生、民族、宗教、社会、生态文明、国家安全、国防和军队、“一国两制”和祖国统一、统一战线、外交、党的建设等方面作出理论分析和政策指导，对党和国家事业发展具有重大指导和引领意义。</p><p>习近平新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义，总任务是实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国；明确新时代我国社会主要矛盾是人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾，必须坚持以人民为中心的发展思想，不断促进人的全面发展、全体人民共同富裕；明确中国特色社会主义事业总体布局是“五位一体”、战略布局是“四个全面”，强调坚定道路自信、理论自信、制度自信、文化自信；明确全面深化改革总目标是完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化；明确全面推进依法治国总目标是建设中国特色社会主义法治体系、建设社会主义法治国家；明确党在新时代的强军目标是建设一支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队；明确中国特色大国外交要推动构建新型国际关系，推动构建人类命运共同体；明确中国特色社会主义最本质的特征是中国共产党领导，中国特色社会主义制度的最大优势是中国共产党领导，党是最高政治领导力量，提出新时代党的建设总体要求，突出政治建设在党的建设中的重要地位。强调新时代坚持和发展中国特色社会主义必须坚持党对一切工作的领导、坚持以人民为中心、坚持全面深化改革、坚持新发展理念、坚持人民当家作主、坚持全面依法治国、坚持社会主义核心价值体系、坚持在发展中保障和改善民生、坚持人与自然和谐共生、坚持国家总体安全观、坚持党对人民军队的绝对领导、坚持“一国两制”和推进祖国统一、坚持推动构建人类命运共同体、坚持全面从严治党。这“八个明确”和“十四个坚持”，体现了指导思想与行动纲领的有机统一，是党团结带领人民为决胜全面建成小康社会、开启全面建设社会主义现代化国家新征程、实现中华民族伟大复兴的中国梦而奋斗的行动纲领和根本遵循。</p><p>一个民族的创造力、凝聚力、战斗力有赖于思想上的团结统一，一个国家要实现现代化必须以科学的理论为行动指南。当代中国，只有中国特色社会主义才能团结凝聚我国最广大人民群众；只有马克思主义中国化最新成果才能指引我国改革开放和社会主义现代化建设的正确方向。将习近平新时代中国特色社会主义思想载入宪法，以国家根本法的形式确认新时代我国发展的根本任务、领导核心、指导思想、发展道路、奋斗目标、战略步骤、基本方略，对于全党全国各族人民深入贯彻党的十九大精神，把思想统一到习近平新时代中国特色社会主义思想上来，把力量凝聚到党的十九大确定的重大战略部署上来，确保到2020年全面建成小康社会、到2035年基本实现社会主义现代化、到本世纪中叶全面建成社会主义现代化强国，具有十分重大的意义。</p><p><strong>三、将习近平新时代中国特色社会主义思想载入宪法，进一步明确坚持党对一切工作的领导这一最高政治原则，有利于巩固党的执政地位和执政基础、为国家发展和民族振兴提供坚强政治保证</strong></p><p>习近平新时代中国特色社会主义思想鲜明提出，中国特色社会主义最本质的特征是中国共产党领导，中国特色社会主义制度最大的优势是中国共产党领导，党是最高政治领导力量；强调党政军民学，东西南北中，党是领导一切的，必须坚持党对一切工作的领导。这是新时代坚持和发展中国特色社会主义的一条基本方略，也是我国政治和社会生活的最高政治原则。</p><p>坚持党对一切工作的领导，首先是坚持党在思想上的领导。毛泽东同志提出：“掌握思想领导是掌握一切领导的第一位。”我们党要团结带领全国各族人民为实现共产主义远大理想和中国特色社会主义共同理想而奋斗，必须通过法定程序把党的指导思想转化为国家的指导思想，牢牢掌握对国家各项事业、各方面工作的思想领导权。</p><p>我国宪法确认了中国共产党的执政地位，确认了党在国家政权结构中总揽全局、协调各方的核心地位，这是我们党长期执政的根本法律依据。党的十八大以来，习近平总书记鲜明提出，坚持依法治国首先要坚持依宪治国，坚持依法执政首先要坚持依宪执政。将习近平新时代中国特色社会主义思想载入宪法，为确保这一思想在国家工作中的指导地位、进一步巩固党的执政地位和执政基础提供了宪法依据。这一重大修改，对于增强全党全国各族人民的政治意识、大局意识、核心意识、看齐意识，自觉维护习近平总书记在党中央、在全党的核心地位，自觉维护党中央权威和集中统一领导，对于我们党通过宪法实施对国家各项事业、各方面工作的领导，更好地推进依法治国、依法执政，至关重要、影响深远。</p><p>宪法具有最高的法律地位、法律权威、法律效力，是国家政治和社会生活的最高行为规范。全国各族人民、一切国家机关和武装力量、各政党和各社会团体、各企业事业组织、城乡基层自治组织，都必须以宪法为根本的活动准则，都负有维护宪法尊严、保证宪法实施的职责。将习近平新时代中国特色社会主义思想载入宪法，赋予其最高法律权威和法律效力，使之成为全体人民的共同意志，成为国家各项事业、各方面工作的根本遵循，有利于在全体人民中强化党的领导意识、把党的领导落实到国家工作全过程和各方面，确保党对国家各项事业、各方面工作的全面领导。<a bosszone="backqqcom" href="http://www.qq.com/?pref=article" target="_blank" title="点击进入腾讯首页" id="backqqcom"><img src="https://mat1.gtimg.com/pingjs/ext2020/dc/src/img/favicon.ico" width="16" height="16"></a></p></div></div>`
                } else {
                    this.templateStyle  = `<p>这是第二个</p>`
                }
            },
        },
        mounted (){
            
        }
    }
</script>
<style>
    .title{
        font-size: 28px;
        color: #243a61;
    }
    .subtitle{
        font-size: 26px;
        color: #999;
    }
    .name {
        font-size: 16px;
        color: #999;
    }
    .type {
        font-size: 16px;
        color: #999;
    }
    .fit-cont{
        margin-left:20px;
        margin-top:20px;
    }
    .add-cont{
        font-size:24px;
        margin-right:10px;
        color:#295fa7;
    }
    .pane-cont{
        margin-left:60px;
    }
    .pet-cont{
        margin-left:30px;
    }
    .split {
        margin-top: 5px;
        line-height: 5px;
    }
    .bottom {
        margin-top: 13px;
        line-height: 12px;
    }
    .image {
        width: 100%;
        display: block;
    }

    .vl-item-date:before,
    .vl-item-date:after {
        display: table;
        content: "";
    }

    .vl-item-date:after {
        clear: both
    }
    .checkContent{
        line-height:40px;
    }
    .content-left div{
        height:45px;
        line-height:45px;
        background:url('../../assets/hui_bg.png') 100%;
        margin-bottom:15px;
        width:150px;
    }
    .content-left{
        width:150px;
    }
    .content-project{
        display:flex;
    }
    .content-left div.checkStyle{
        background:url('../../assets/lan_bg.png') 100%;
        color:#fff;
        width:150px;
    }
</style>
